summary(vgg_19, (3, 44, 44))

----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 44, 44]           1,792
       BatchNorm2d-2           [-1, 64, 44, 44]             128
              ReLU-3           [-1, 64, 44, 44]               0
            Conv2d-4           [-1, 64, 44, 44]          36,928
       BatchNorm2d-5           [-1, 64, 44, 44]             128
              ReLU-6           [-1, 64, 44, 44]               0
         MaxPool2d-7           [-1, 64, 22, 22]               0
            Conv2d-8          [-1, 128, 22, 22]          73,856
       BatchNorm2d-9          [-1, 128, 22, 22]             256
             ReLU-10          [-1, 128, 22, 22]               0
           Conv2d-11          [-1, 128, 22, 22]         147,584
      BatchNorm2d-12          [-1, 128, 22, 22]             256
             ReLU-13          [-1, 128, 22, 22]               0
        MaxPool2d-14          [-1, 128, 11, 11]               0
           Conv2d-15          [-1, 256, 11, 11]         295,168
      BatchNorm2d-16          [-1, 256, 11, 11]             512
             ReLU-17          [-1, 256, 11, 11]               0
           Conv2d-18          [-1, 256, 11, 11]         590,080
      BatchNorm2d-19          [-1, 256, 11, 11]             512
             ReLU-20          [-1, 256, 11, 11]               0
           Conv2d-21          [-1, 256, 11, 11]         590,080
      BatchNorm2d-22          [-1, 256, 11, 11]             512
             ReLU-23          [-1, 256, 11, 11]               0
           Conv2d-24          [-1, 256, 11, 11]         590,080
      BatchNorm2d-25          [-1, 256, 11, 11]             512
             ReLU-26          [-1, 256, 11, 11]               0
        MaxPool2d-27            [-1, 256, 5, 5]               0
           Conv2d-28            [-1, 512, 5, 5]       1,180,160
      BatchNorm2d-29            [-1, 512, 5, 5]           1,024
             ReLU-30            [-1, 512, 5, 5]               0
           Conv2d-31            [-1, 512, 5, 5]       2,359,808
      BatchNorm2d-32            [-1, 512, 5, 5]           1,024
             ReLU-33            [-1, 512, 5, 5]               0
           Conv2d-34            [-1, 512, 5, 5]       2,359,808
      BatchNorm2d-35            [-1, 512, 5, 5]           1,024
             ReLU-36            [-1, 512, 5, 5]               0
           Conv2d-37            [-1, 512, 5, 5]       2,359,808
      BatchNorm2d-38            [-1, 512, 5, 5]           1,024
             ReLU-39            [-1, 512, 5, 5]               0
        MaxPool2d-40            [-1, 512, 2, 2]               0
           Conv2d-41            [-1, 512, 2, 2]       2,359,808
      BatchNorm2d-42            [-1, 512, 2, 2]           1,024
             ReLU-43            [-1, 512, 2, 2]               0
           Conv2d-44            [-1, 512, 2, 2]       2,359,808
      BatchNorm2d-45            [-1, 512, 2, 2]           1,024
             ReLU-46            [-1, 512, 2, 2]               0
           Conv2d-47            [-1, 512, 2, 2]       2,359,808
      BatchNorm2d-48            [-1, 512, 2, 2]           1,024
             ReLU-49            [-1, 512, 2, 2]               0
           Conv2d-50            [-1, 512, 2, 2]       2,359,808
      BatchNorm2d-51            [-1, 512, 2, 2]           1,024
             ReLU-52            [-1, 512, 2, 2]               0
        MaxPool2d-53            [-1, 512, 1, 1]               0
        AvgPool2d-54            [-1, 512, 1, 1]               0
           Linear-55                    [-1, 7]           3,591
================================================================
Total params: 20,038,983
Trainable params: 20,038,983
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.02
Forward/backward pass size (MB): 13.13
Params size (MB): 76.44
Estimated Total Size (MB): 89.59
----------------------------------------------------------------